[
    {
        "category": "Sins Against God",
        "sins": [
            {
                "question": "Did I deny or doubt God's existence?",
                "mortal": true,
                "ccc": "2087",
                "details": "Faith requires belief in God and rejects all forms of atheism or agnosticism."
            },
            {
                "question": "Did I refuse to believe God's revelation?",
                "mortal": true,
                "ccc": "2088",
                "details": "Refusing God’s revelation is a serious offense against faith."
            },
            {
                "question": "Did I believe in horoscopes, fortune telling, good luck charms, tarot cards, Ouija boards, or reincarnation?",
                "mortal": true,
                "ccc": "2116",
                "details": "Practices like divination demonstrate a lack of trust in God."
            },
            {
                "question": "Did I deny that I was a Catholic?",
                "mortal": true,
                "ccc": "2148",
                "details": "Denial of faith is a serious offense."
            },
            {
                "question": "Did I abandon the Catholic Faith for any period of time?",
                "mortal": true,
                "ccc": "2089",
                "details": "Apostasy or abandonment of faith is a grave offense."
            },
            {
                "question": "Did I despair of or presume on God's mercy?",
                "mortal": true,
                "ccc": "2091",
                "details": "Despair and presumption are offenses against trust in God."
            },
            {
                "question": "Did I neglect prayer for a long time?",
                "mortal": false,
                "ccc": "2745",
                "details": "Neglecting prayer weakens one’s relationship with God."
            },
            {
                "question": "Did I fail to pray daily?",
                "mortal": false,
                "ccc": "2744",
                "details": "Daily prayer is essential to maintain spiritual health."
            },
            {
                "question": "Did I blaspheme God or take God's Name in vain, curse, or break an oath or vow?",
                "mortal": true,
                "ccc": "2148",
                "details": "Blasphemy is a grave offense against the second commandment."
            },
            {
                "question": "Did I miss Mass on a Sunday or on a Holy Day of Obligation through my own fault?",
                "mortal": true,
                "ccc": "2181",
                "details": "Failing to attend Mass without valid reason is a serious sin."
            },
            {
                "question": "Am I always reverent in the presence of the Most Blessed Sacrament?",
                "mortal": false,
                "ccc": "1378",
                "details": "Reverence is due in the presence of the Eucharist."
            },
            {
                "question": "Was I voluntarily inattentive at Mass?",
                "mortal": false,
                "ccc": "1324",
                "details": "Mass requires active participation and attention."
            },
            {
                "question": "Did I arrive at Mass late through my own fault?",
                "mortal": false,
                "ccc": "2181",
                "details": "Punctuality shows respect for the Mass."
            },
            {
                "question": "Did I leave Mass early?",
                "mortal": false,
                "ccc": "2181",
                "details": "Leaving Mass early without serious reason is disrespectful."
            },
            {
                "question": "Did I do unnecessary servile work on Sunday?",
                "mortal": true,
                "ccc": "2185",
                "details": "Sunday is a day of rest and worship, not for servile labor."
            }
        ]
    },
    {
        "category": "Sins Against Family and Relationships",
        "sins": [
            {
                "question": "Did I disobey or disrespect my parents or legitimate superiors?",
                "mortal": true,
                "ccc": "2199",
                "details": "Respect for authority is part of the Fourth Commandment."
            },
            {
                "question": "Did I neglect my duties to my husband, wife, children, or parents?",
                "mortal": true,
                "ccc": "2201",
                "details": "Family members are called to honor their responsibilities to each other."
            },
            {
                "question": "Did I fail to actively take an interest in the religious education and formation of my children?",
                "mortal": false,
                "ccc": "2223",
                "details": "Parents are obligated to educate their children in faith."
            },
            {
                "question": "Have I failed to educate myself concerning the teachings of the Church?",
                "mortal": false,
                "ccc": "2035",
                "details": "Learning the teachings of the Church is a lifelong responsibility."
            },
            {
                "question": "Did I give a full day's work in return for a full day's pay?",
                "mortal": false,
                "ccc": "2434",
                "details": "Just work for just pay is part of respecting labor rights."
            },
            {
                "question": "Did I give a fair wage to my employee(s)?",
                "mortal": true,
                "ccc": "2434",
                "details": "Fair wages are required by justice and the dignity of work."
            },
            {
                "question": "Did I give scandal by what I said or did, especially to the young?",
                "mortal": true,
                "ccc": "2284",
                "details": "Giving scandal leads others to sin and is a grave offense."
            },
            {
                "question": "Did I contribute to anyone's abandoning of the Catholic Faith?",
                "mortal": true,
                "ccc": "2284",
                "details": "Leading others away from faith is a serious sin."
            },
            {
                "question": "Was I uncharitable in thought, word, or deed?",
                "mortal": false,
                "ccc": "2303",
                "details": "Charity requires us to love our neighbor as ourselves."
            }
        ]
    },
    {
        "category": "Sins Against Life and the Body",
        "sins": [
            {
                "question": "Did I physically injure or kill anyone?",
                "mortal": true,
                "ccc": "2268",
                "details": "Harming others is against the Fifth Commandment."
            },
            {
                "question": "Have I had an abortion, or advised or supported an abortion?",
                "mortal": true,
                "ccc": "2271",
                "details": "Abortion is a grave sin against the sanctity of life."
            },
            {
                "question": "Did I participate in or approve of euthanasia or doctor-assisted suicide?",
                "mortal": true,
                "ccc": "2277",
                "details": "Taking life through euthanasia or assisted suicide is gravely sinful."
            },
            {
                "question": "Did I attempt suicide or physically harm myself?",
                "mortal": true,
                "ccc": "2281",
                "details": "The Church teaches against self-harm and suicide."
            },
            {
                "question": "Did I willfully entertain impure thoughts and desires?",
                "mortal": true,
                "ccc": "2351",
                "details": "Impure thoughts and desires are serious sins against chastity."
            },
            {
                "question": "Did I dress immodestly or provocatively?",
                "mortal": false,
                "ccc": "2521",
                "details": "Modesty protects the virtue of chastity."
            },
            {
                "question": "Did I use impure or suggestive words?",
                "mortal": false,
                "ccc": "2522",
                "details": "Speech should reflect chastity and respect."
            },
            {
                "question": "Did I deliberately look at impure television, internet content, plays, pictures, or movies?",
                "mortal": true,
                "ccc": "2354",
                "details": "Viewing impure material violates chastity."
            },
            {
                "question": "Did I read or send impure material?",
                "mortal": true,
                "ccc": "2354",
                "details": "Engaging in impure materials, including reading or sharing, is sinful."
            },
            {
                "question": "Did I perform impure acts, such as masturbation, adultery, fornication, or sodomy?",
                "mortal": true,
                "ccc": "2352",
                "details": "Impure acts violate the call to chastity and the purpose of human sexuality."
            }
        ]
    },
    {
        "category": "Sins Against Honesty and Justice",
        "sins": [
            {
                "question": "Did I steal, cheat, help or encourage others to steal or cheat, or keep stolen goods?",
                "mortal": true,
                "ccc": "2409",
                "details": "Theft and deceit are offenses against justice and respect for others' property."
            },
            {
                "question": "Have I made restitution for stolen goods?",
                "mortal": true,
                "ccc": "2412",
                "details": "Restitution is required to remedy the injustice of theft."
            },
            {
                "question": "Did I fail to fulfill my contracts or pay my bills?",
                "mortal": false,
                "ccc": "2410",
                "details": "Honoring agreements is part of social justice."
            },
            {
                "question": "Did I give or accept bribes?",
                "mortal": true,
                "ccc": "2409",
                "details": "Bribery undermines justice and fairness."
            },
            {
                "question": "Did I tell lies to deceive or harm others, commit slander, or commit calumny?",
                "mortal": true,
                "ccc": "2477",
                "details": "Lying, slander, and calumny are sins against truth and justice."
            },
            {
                "question": "Did I fail to keep secrets I should have kept?",
                "mortal": false,
                "ccc": "2489",
                "details": "Keeping appropriate confidences respects privacy and trust."
            }
        ]
    },
    {
        "category": "Sins Against Charity and Love",
        "sins": [
            {
                "question": "Did I forgive those who have hurt me or my loved ones?",
                "mortal": false,
                "ccc": "2843",
                "details": "Forgiveness is central to the Christian life and necessary for reconciliation."
            },
            {
                "question": "Did I vote according to a properly informed conscience, consistent with Church teachings?",
                "mortal": true,
                "ccc": "2240",
                "details": "Christians have a duty to vote in line with values of justice and respect for life."
            }
        ]
    }
]